<h1 align="center">Bank Credit Card Launch: Phase 1</h1>

### Objective: Analyze customers' transactions and credit profiles to figure out a target group for the launch of AtliQo bank credit card

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

In [18]:
df_cust = pd.read_csv('datasets/customers.csv')
df_cs = pd.read_csv('datasets/credit_profiles.csv')
df_trans = pd.read_csv('datasets/transactions.csv')

In [5]:
df_cust.head()

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,1,Manya Acharya,Female,2,City,Business Owner,358211.0,Married
1,2,Anjali Pandey,Female,47,City,Consultant,65172.0,Single
2,3,Aaryan Chauhan,Male,21,City,Freelancer,22378.0,Married
3,4,Rudra Bali,Male,24,Rural,Freelancer,33563.0,Married
4,5,Advait Malik,Male,48,City,Consultant,39406.0,Married

In [8]:
df_cust.describe()

           cust_id          age  annual_income
count  1000.000000  1000.000000     950.000000
mean    500.500000    36.405000  139410.314737
std     288.819436    15.666155  112416.802007
min       1.000000     1.000000       2.000000
25%     250.750000    26.000000   47627.500000
50%     500.500000    32.000000  112218.500000
75%     750.250000    46.000000  193137.500000
max    1000.000000   135.000000  449346.000000

In [19]:
df_cust.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

In [20]:
df_cust[df_cust["annual_income"].isnull() == True].head()

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
14,15,Sanjana Malik,Female,25,Rural,Artist,NaN,Married
82,83,Reyansh Mukherjee,Male,27,City,Freelancer,NaN,Single
97,98,Virat Puri,Male,47,Suburb,Business Owner,NaN,Married
102,103,Aarav Shah,Male,32,City,Data Scientist,NaN,Married
155,156,Kiaan Saxena,Male,24,City,Fullstack Developer,NaN,Married

In [21]:
# median_df_cust_annual_income = df_cust["annual_income"].median()
# median_df_cust_annual_income
#first intake- however with different offupations we should use different medians for each occ

In [22]:
median_by_occupation = df_cust.groupby("occupation")["annual_income"].median()
median_by_occupation

occupation
Accountant              65265.0
Artist                  45794.0
Business Owner         261191.5
Consultant              58017.0
Data Scientist         135759.0
Freelancer              46759.0
Fullstack Developer     76774.0
Name: annual_income, dtype: float64

In [27]:
def get_median_val(row):
    if pd.isnull(row["annual_income"]):
        return median_by_occupation[row["occupation"]]
    else:
        return row["annual_income"]

In [ ]:
#quick testing
get_median_val({"occupation": "Artist", "annual_income": None})

45794.0

In [30]:
#applying the function to cover null values based on occupation

df_cust["annual_income"] = df_cust.apply(get_median_val, axis=1)

In [31]:
df_cust["annual_income"].isnull().sum()

0

In [ ]:
# df_cust["annual_income"] = df_cust.apply(
#     lambda row: median_by_occupation[row["occupation"]] if pd.isnull(row["annual_income"]) else row["annual_income"],
#         axis=1)

In [6]:
df_cs.head()

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
0,1,749,0.585171,19571.0,0.0,40000.0
1,2,587,0.107928,161644.0,2.0,1250.0
2,3,544,0.854807,513.0,4.0,1000.0
3,4,504,0.336938,224.0,2.0,1000.0
4,5,708,0.586151,18090.0,2.0,40000.0

In [7]:
df_trans.head()

,tran_id,cust_id,tran_date,tran_amount,platform,product_category,payment_type
0,1,705,2023-01-01,63,Flipkart,Electronics,Phonepe
1,2,385,2023-01-01,99,Alibaba,Fashion & Apparel,Credit Card
2,3,924,2023-01-01,471,Shopify,Sports,Phonepe
3,4,797,2023-01-01,33,Shopify,Fashion & Apparel,Gpay
4,5,482,2023-01-01,68,Amazon,Fashion & Apparel,Net Banking